src/InformationRegisters/НормыСписанияМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НормыСписанияМатериалов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключатьВСтоимостьУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЗависитОтКоличестваУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НормыСписанияНеИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бесплатно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоминала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОнлайнЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОнлайнЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНоменклатурыМедицинскиУслуг</Name>
					<Comment>Код услуги (Приказ МЗ РФ от 13.10.2017г. №804Н)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМедицинскихУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНоменклатурыМедицинскихУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменССайтомСоответствиеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноУказаниеАссистента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляОнлайнЗаписиAPI</Name>
					<Comment>Описание, которое отдаем в API, для выгрузки нам нужно только body, что бы в API не терять из-за обрезки время, добавили доп. реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатМногоразовоеИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкиЗапрещены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация для номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСрокаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокДействияПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковкаДляОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковкаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗапас</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИменнойСертификат</Name>
					<Comment>Это именной сертификат</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИмущество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПакетУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПодарочныйСертификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластиЗубнойФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СостояниеЗубнойФормулы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостояниеЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СННоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НормыСписанияМатериалов/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция - Получить нормы списания материалов
//
// Параметры:
//  Номенклатура		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьНормыСписанияМатериалов(Номенклатура, СтруктурнаяЕдиница, Упаковка = Неопределено, Материал = Неопределено) Экспорт
		                           
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НормыСписанияМатериалов.Материал КАК Материал,
	|	НормыСписанияМатериалов.Номенклатура КАК Номенклатура,
	|	НормыСписанияМатериалов.Партия КАК Партия,
	|	НормыСписанияМатериалов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НормыСписанияМатериалов.ВидЦен КАК ВидЦен,
	|	НормыСписанияМатериалов.Количество КАК Количество,
	|	НормыСписанияМатериалов.СкладСписания КАК СкладСписания,
	|	НормыСписанияМатериалов.Упаковка КАК Упаковка,
	|	НормыСписанияМатериалов.Номенклатура.ЕдиницаИзмерения.Наименование КАК НоменклатураЕдиницаИзмерения,
	|	НормыСписанияМатериалов.ВключатьВСтоимостьУслуги КАК ВключатьВСтоимостьУслуги,
	|	НормыСписанияМатериалов.НеЗависитОтКоличестваУслуг КАК НеЗависитОтКоличестваУслуг,
	|	НормыСписанияМатериалов.НормыСписанияНеИспользуются КАК НормыСписанияНеИспользуются
	|ПОМЕСТИТЬ НормыСписанияМатериалов
	|ИЗ
	|	РегистрСведений.НормыСписанияМатериалов КАК НормыСписанияМатериалов
	|ГДЕ
	|	НормыСписанияМатериалов.Номенклатура = &Номенклатура
	|	И ВЫБОР
	|			КОГДА &Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НормыСписанияМатериалов.Упаковка = &Упаковка
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Материал = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НормыСписанияМатериалов.Материал = &Материал
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НормыСписанияМатериалов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НормыСписанияМатериалов.Номенклатура КАК Номенклатура,
	|	НормыСписанияМатериалов.Материал КАК Материал,
	|	НормыСписанияМатериалов.СкладСписания КАК СкладСписания,
	|	НормыСписанияМатериалов.Партия КАК Партия,
	|	НормыСписанияМатериалов.Упаковка КАК Упаковка,
	|	НормыСписанияМатериалов.Количество КАК Количество,
	|	НормыСписанияМатериалов.ВидЦен КАК ВидЦен,
	|	НормыСписанияМатериалов.НоменклатураЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НормыСписанияМатериалов.ВключатьВСтоимостьУслуги КАК ВключатьВСтоимостьУслуги,
	|	НормыСписанияМатериалов.НеЗависитОтКоличестваУслуг КАК НеЗависитОтКоличестваУслуг,
	|	НормыСписанияМатериалов.НормыСписанияНеИспользуются КАК НормыСписанияНеИспользуются
	|ИЗ
	|	НормыСписанияМатериалов КАК НормыСписанияМатериалов
	|ГДЕ
	|	НормыСписанияМатериалов.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	Материал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НормыСписанияМатериалов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	НормыСписанияМатериалов.Номенклатура КАК Номенклатура,
	|	НормыСписанияМатериалов.Материал КАК Материал,
	|	НормыСписанияМатериалов.СкладСписания КАК СкладСписания,
	|	НормыСписанияМатериалов.Партия КАК Партия,
	|	НормыСписанияМатериалов.Упаковка КАК Упаковка,
	|	НормыСписанияМатериалов.Количество КАК Количество,
	|	НормыСписанияМатериалов.ВидЦен КАК ВидЦен,
	|	НормыСписанияМатериалов.НоменклатураЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НормыСписанияМатериалов.ВключатьВСтоимостьУслуги КАК ВключатьВСтоимостьУслуги,
	|	НормыСписанияМатериалов.НеЗависитОтКоличестваУслуг КАК НеЗависитОтКоличестваУслуг,
	|	НормыСписанияМатериалов.НормыСписанияНеИспользуются КАК НормыСписанияНеИспользуются
	|ИЗ
	|	НормыСписанияМатериалов КАК НормыСписанияМатериалов
	|ГДЕ
	|	НормыСписанияМатериалов.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Материал";   
	
	Запрос.УстановитьПараметр("Номенклатура"		, Номенклатура);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Если Упаковка <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		
	Иначе 
		
		Запрос.УстановитьПараметр("Упаковка", Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
		
	КонецЕсли;
	Если Материал <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("Материал", Материал);
		
	Иначе
		
		Запрос.УстановитьПараметр("Материал", Справочники.Номенклатура.ПустаяСсылка());

	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ИндивидуальныеНормыСписания = Пакет[1].Выгрузить();
	ОбщиеНормыСписания			= Пакет[2].Выгрузить();
	
	Возврат ?(ИндивидуальныеНормыСписания.Количество() = 0, ОбщиеНормыСписания, ИндивидуальныеНормыСписания);
	
КонецФункции                                                         

// Процедура - Записать нормы списания в регистр
//
// Параметры:
//  НоменклатураНормСписания - 	 - 
//  СтруктурнаяЕдиница		 - 	 - 
//
Процедура ЗаписатьНормыСписанияВРегистр(НоменклатураНормСписания, СтруктурнаяЕдиница) Экспорт
	
	НаборЗаписей = РегистрыСведений.НормыСписанияМатериалов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(НоменклатураНормСписания);
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
	
	НаборЗаписей.Отбор.СтруктурнаяЕдиница.Значение = СтруктурнаяЕдиница;
	НаборЗаписей.Отбор.Номенклатура.Значение = СтруктурнаяЕдиница;
			
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Функция - Получить склад списания норм материалов
//
// Параметры:
//  СтрокаТЧ			 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
//  Помещение			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСкладСписанияНормМатериалов(СтрокаТЧ, СтруктурнаяЕдиница, Сотрудник) Экспорт
	
	// Индивидуальная норма списания.
	СкладСписания = Справочники.Склады.ПустаяСсылка();
	Если ЗначениеЗаполнено(СтрокаТЧ.СтруктурнаяЕдиница) И ЗначениеЗаполнено(СтрокаТЧ.СкладСписания) Тогда  
		
		СкладСписания = СтрокаТЧ.СкладСписания; 
		
	// Общие нормы списания.
	ИначеЕсли ТипЗнч(СтрокаТЧ.СкладСписания) = Тип("СправочникСсылка.Склады") Тогда
		
		СкладСписания = СтруктурнаяЕдиница.ОсновнойСклад;
		
		Если НЕ ЗначениеЗаполнено(СкладСписания) Тогда
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СтруктурнаяЕдиница) Тогда
				СкладСписания = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТЧ.СтруктурнаяЕдиница, "ОсновнойСклад");	
			Иначе
				СкладСписания = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтруктурнаяЕдиница, "ОсновнойСклад"); 
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		СкладСписания = Сотрудник;
		
	КонецЕсли;
	
	Возврат СкладСписания;
	
КонецФункции

#Область ЗагрузкаДанныхИзВнешнегоИсточника

// Процедура - Записи в регистре для номенклатуры существуют
//
// Параметры:
//  Номенклатура - 	 - 
//
Функция ЗаписиВРегистреДляНоменклатурыСуществуют(Номенклатура) Экспорт
	
	НаборЗаписей = РегистрыСведений.НормыСписанияМатериалов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() > 0;	

КонецФункции 

// Процедура - При определении образцов загрузки данных.
//
Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

// Процедура - Поля загрузки данных из внешнего источника.
//
Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока11 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(11));
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураКодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 1);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "МатериалКодСинхронизации","Код синхронизации", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Материал", 1);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "МатериалНаименование","Материал (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Материал", 2,, Истина);
		
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВключатьВСтоимостьУслуги", "Включать в стоимость услуги", ОписаниеТиповСтрока11, ОписаниеТиповБулево);

	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НеЗависитОтКоличестваУслуг", "Зависит от услуг", ОписаниеТиповСтрока11, ОписаниеТиповБулево);

	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтруктурнаяЕдиница","Структурная единица", ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Склады");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СкладСписания","Склад списания", ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ВидыЦен");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ВидЦен","Вид цен стоимости материалов", ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Упаковка", "Упаковка", ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	
	//ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Калькуляции");
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Калькуляция", "Калькуляция", ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	
КонецПроцедуры

// Процедура - Сопоставить загружаемые данные из внешнего источника.
//
Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	Перем ОбщееЗначение;
	
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	
	ОбновлятьДанные = НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	
	НастройкиЗагрузкиДанных.Свойство("ОбщееЗначение", ОбщееЗначение);
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура
		СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураКодСинхронизации, Перечисления.ТипыНоменклатуры.Услуга);	
		
		// Материал
		СопоставитьНоменклатуру(СтрокаТаблицыФормы.Материал, СтрокаТаблицыФормы.МатериалНаименование, СтрокаТаблицыФормы.МатериалКодСинхронизации, Перечисления.ТипыНоменклатуры.Запас);
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные);
		
		// Структурная единица
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтруктурнуюЕдиницу(СтрокаТаблицыФормы.СтруктурнаяЕдиница, СтрокаТаблицыФормы.СтруктурнаяЕдиница_ВходящиеДанные, Неопределено);
		
		// Склад списания
		СопоставитьСклад(СтрокаТаблицыФормы.СкладСписания, СтрокаТаблицыФормы.СкладСписания_ВходящиеДанные, СтрокаТаблицыФормы.СтруктурнаяЕдиница);
		
		// Включать в стоимость услуги
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.ВключатьВСтоимостьУслуги, СтрокаТаблицыФормы.ВключатьВСтоимостьУслуги_ВходящиеДанные);
		
		// Не зависит от количества услуг
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВБулево(СтрокаТаблицыФормы.НеЗависитОтКоличестваУслуг, СтрокаТаблицыФормы.НеЗависитОтКоличестваУслуг_ВходящиеДанные);
		
		// Вид цен стоимости материалов
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьВидЦен(СтрокаТаблицыФормы.ВидЦен, СтрокаТаблицыФормы.ВидЦен_ВходящиеДанные, Справочники.ВидыЦен.ПустаяСсылка());
		
		// Упаковка
		НоменклатураУпаковки = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.НоменклатураНаименование);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.Упаковка, СтрокаТаблицыФормы.Упаковка_ВходящиеДанные, Неопределено, НоменклатураУпаковки);
		
		//// Калькуляция
		//СопоставитьКалькуляцию(СтрокаТаблицыФормы.Калькуляция, СтрокаТаблицыФормы.Калькуляция_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

// Процедура - Проверить корректность данных в строке таблицы.
//
Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Количество)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
	
	Если СтрокаТаблицыФормы[ИмяСлужебногоПоля] Тогда
		
		НаборЗаписей = РегистрыСведений.НормыСписанияМатериалов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтрокаТаблицыФормы.СтруктурнаяЕдиница);
		НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицыФормы.Номенклатура);
		НаборЗаписей.Отбор.Материал.Установить(СтрокаТаблицыФормы.Материал);
		//НаборЗаписей.Отбор.Калькуляция.Установить(СтрокаТаблицыФормы.Калькуляция);
		
		НаборЗаписей.Прочитать();
		
		СтрокаТаблицыФормы._СтрокаСопоставлена = (НаборЗаписей.Количество() > 0);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработать подготовленные данные.
//
Процедура ОбработатьПодготовленныеДанные(СтруктураДанных, ФоновоеЗаданиеАдресХранилища = "") Экспорт
	
	ОбновлятьСуществующие		= СтруктураДанных.НастройкиЗагрузкиДанных.ОбновлятьСуществующие;
	СоздаватьНовые 				= СтруктураДанных.НастройкиЗагрузкиДанных.СоздаватьЕслиНеСопоставлено;
	ТаблицаСопоставленияДанных	= СтруктураДанных.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	КоличествоЗаписейТранзакции	= 0;
	ТранзакцияОткрыта			= Ложь;
	
	Попытка
		
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			Если НЕ ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции = 0 Тогда
				
				НачатьТранзакцию();
				ТранзакцияОткрыта = Истина;
				
			КонецЕсли;
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			
			СогласованноеСостояниеСтроки = (СтрокаТаблицы._СтрокаСопоставлена И ОбновлятьСуществующие) 
				ИЛИ (НЕ СтрокаТаблицы._СтрокаСопоставлена И СоздаватьНовые);
			
			Если ЗагрузкаВПриложениеВозможна И СогласованноеСостояниеСтроки Тогда
				
				КоличествоЗаписейТранзакции = КоличествоЗаписейТранзакции + 1;
				
				// Создаем материал
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.Материал) Тогда
					
					НовыйМатериал = Справочники.Номенклатура.СоздатьЭлемент();
					НовыйМатериал.Заполнить(Новый Структура);
					НовыйМатериал.Наименование = ?(ЗначениеЗаполнено(СтрокаТаблицы.МатериалНаименование), СтрокаТаблицы.МатериалНаименование, "Загруженный материал " + СтрокаТаблицы.МатериалКодСинхронизации);
					НовыйМатериал.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("Материалы");
					НовыйМатериал.КодСинхронизации = СтрокаТаблицы.МатериалКодСинхронизации;
					НовыйМатериал.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал;
					НовыйМатериал.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
					НовыйМатериал.Записать();
					
					СтрокаТаблицы.Материал = НовыйМатериал.Ссылка;
					
				КонецЕсли;
								
				НаборЗаписей = РегистрыСведений.НормыСписанияМатериалов.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтрокаТаблицы.СтруктурнаяЕдиница);
				НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
				НаборЗаписей.Отбор.Материал.Установить(СтрокаТаблицы.Материал);
				//НаборЗаписей.Отбор.Калькуляция.Установить(СтрокаТаблицы.Калькуляция);
				
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() <> 0 Тогда				
					НаборЗаписей.Очистить();				
				КонецЕсли;
				
				НоваяСтрока = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				НоваяСтрока.ВключатьВСтоимостьУслуги = СтрокаТаблицы.ВключатьВСтоимостьУслуги;
				//НоваяСтрока.НеЗависитОтКоличестваУслуг = Не НоваяСтрока.НеЗависитОтКоличестваУслуг;
				//НоваяСтрока.НормыСписанияНеИспользуются = ?(СтрокаТаблицы.Количество = 0, Истина, Ложь);
							
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
			ИндексТекущейстроки	= ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицы);
			ТекстПрогресса		= СтрШаблон(НСтр("ru ='Обработано %1 из %2 строк...'"), ИндексТекущейстроки, РазмерТаблицыДанных);
			
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ДлительныеОперации.СообщитьПрогресс(ОКР(ИндексТекущейстроки * 100 / РазмерТаблицыДанных, 1), ТекстПрогресса);
			#КонецЕсли
			Если ТранзакцияОткрыта
				И КоличествоЗаписейТранзакции > ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.МаксимумЗаписейВОднойТранзакции() Тогда
				
				ЗафиксироватьТранзакцию();			
				ТранзакцияОткрыта = Ложь;
				КоличествоЗаписейТранзакции = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоЗаписейТранзакции > 0 Тогда
			
			ЗафиксироватьТранзакцию();	
			ТранзакцияОткрыта = Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ru='Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЦеныНоменклатуры, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Функция, возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	//Результат = Новый Массив;
	//Результат.Добавить("ТипНоменклатуры");
	//
	//Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Процедура - Сопоставить номенклатуру.
//
Процедура СопоставитьНоменклатуру(Номенклатура, Наименование = Неопределено, КодСинхронизации = Неопределено, ТипНоменклатуры = Неопределено)
	
	НоменклатураНайденная = Справочники.Номенклатура.ПустаяСсылка();
	Если НЕ ЗначениеЗаполнено(Наименование) И НЕ ЗначениеЗаполнено(КодСинхронизации) Тогда		
		Номенклатура = НоменклатураНайденная;
	Иначе
		
		Если ЗначениеЗаполнено(КодСинхронизации) Тогда
			
			// поиск по коду синхронизации
			Попытка
				НоменклатураНайденная = Справочники.Номенклатура.НайтиПоРеквизиту("КодСинхронизации", КодСинхронизации);				
			Исключение
				НоменклатураНайденная = Справочники.Номенклатура.ПустаяСсылка();
			КонецПопытки;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоменклатураНайденная) 
			И ЗначениеЗаполнено(Наименование) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	НЕ Номенклатура.ПометкаУдаления
			|	И Номенклатура.Наименование ПОДОБНО &Наименование
			|	И &УсловиеТипНоменклатуры";
			Запрос.УстановитьПараметр("Наименование", Наименование + "%");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТипНоменклатуры", ?(ЗначениеЗаполнено(ТипНоменклатуры), "Номенклатура.ТипНоменклатуры = &ТипНоменклатуры", ""));
			Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
				Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры);
			КонецЕсли;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоменклатураНайденная = Выборка.Ссылка;
			КонецЦикла;
			
		КонецЕсли;
		
		Номенклатура = НоменклатураНайденная;
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Сопоставить склад.
//
Процедура СопоставитьСклад(СкладЗначение, СкладВходящиеДанные, СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ПометкаУдаления
	|	И НЕ Склады.ЭтоГруппа
	|	И Склады.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Склады.Наименование = &Наименование";
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Наименование", СкладВходящиеДанные);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СкладЗначение = Выборка.Склад;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти   

#КонецОбласти
